In [1]:
import pandas as pd

In [2]:
data= [["harsh", 99],["avinash", 90],["chandan", 86],["raja", 80],["himanshu", 84],["prem", 75]]
data

[['harsh', 99],
 ['avinash', 90],
 ['chandan', 86],
 ['raja', 80],
 ['himanshu', 84],
 ['prem', 75]]

In [3]:
pd.DataFrame(data, columns=["Names","Marks"])

      Names  Marks
0     harsh     99
1   avinash     90
2   chandan     86
3      raja     80
4  himanshu     84
5      prem     75

In [5]:
data2={"friends":['harsh','chandan','ayush'], "age":[22,33,44]}
data2

{'friends': ['harsh', 'chandan', 'ayush'], 'age': [22, 33, 44]}

In [8]:
df= pd.DataFrame(data2)

In [9]:
df

   friends  age
0    harsh   22
1  chandan   33
2    ayush   44

In [10]:
import numpy as np

In [14]:
arr= np.array([[1,2,3],[4,5,6],[7,8,9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [16]:
df=pd.DataFrame(arr,columns=["A","B","C"])

In [17]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
pd.read_excel("data.xlsx")

       Name School  Marks
0     Harsh    abc     73
1   Chandan    def     89
2      raja    ghi     78
3   avinash    jkl     76
4  himanshu    mno     67
5     ayush    pqr     65
6    manish    stu     60
7       sid    vwx     77

In [31]:
pd.read_csv("data.csv")

       Name School  Marks
0     Harsh    abc     73
1   Chandan    def     89
2      raja    ghi     78
3   avinash    jkl     76
4  himanshu    mno     67
5     ayush    pqr     65
6    manish    stu     60
7       sid    vwx     77

In [37]:
df=pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data")
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [38]:
df.head

<bound method NDFrame.head of      5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]>

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [40]:
df.describe()

              5.1         3.5         1.4         0.2
count  149.000000  149.000000  149.000000  149.000000
mean     5.848322    3.051007    3.774497    1.205369
std      0.828594    0.433499    1.759651    0.761292
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.400000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [42]:
df.shape

(149, 5)